{
  "lang_en": "en",
  "lang_de": "de",
  "title": "Danial Eyvazi",
  "nav_about": "Über mich",
  "nav_education": "Ausbildung",
  "nav_skills": "Fähigkeiten",
  "nav_projects": "Projekte",
  "nav_services": "Dienstleistungen",
  "nav_contact": "Kontakt",
  "header_hello_world": "< Hallo Welt />",
  "header_name": "Ich bin Danial Eyvazi",
  "header_profession_frontend": "FRONTEND-ENTWICKLER",
  "header_profession_blockchain": "BLOCKCHAIN-ENTWICKLER",
  "header_more_about_me": "MEHR ÜBER MICH",
  "about_heading": "ÜBER MICH",
  "about_intro": "Lassen Sie mich mich vorstellen.",
  "about_description": "Ich bin entschlossen, mich im Bereich der Webentwicklung weiterzubilden und zu wachsen. Mit einer soliden Grundlage in HTML, CSS und JavaScript strebe ich danach, qualitativ hochwertigen Code zu produzieren und ansprechende Benutzererlebnisse zu liefern. Als schneller Lerner und Teamplayer bin ich bestrebt, mit erfahrenen Entwicklern zusammenzuarbeiten, um wertvolle Fähigkeiten zu erwerben und zu spannenden Projekten beizutragen. Ich bin leidenschaftlich daran interessiert, über die neuesten Trends und Technologien auf dem Laufenden zu bleiben, und widme mich der Aufgabe, ein wertvolles Mitglied jedes Teams zu werden.",
  "profile_heading": "PROFIL",
  "profile_description": "Hallo, ich bin Danial Eyvazi, ein leidenschaftlicher Programmierer geboren am 6. März 2002 in Teheran. Derzeit studiere ich Informatik an der Constructor University in Bremen. Ich bin engagiert für kontinuierliches Lernen und Wachstum in der Tech-Branche. Lass uns vernetzen!",
  "profile_fullname_label": "VOLLSTÄNDIGER NAME :",
  "profile_fullname_value": "Danial Eyvazi",
  "profile_birth_date_label": "GEBURTSDATUM :",
  "profile_birth_date_value": "06. März 2002",
  "profile_profession_label": "Beruf :",
  "profile_profession_value": "Frontend | Smart Contract Entwicklung",
  "profile_email_label": "E-MAIL :",
  "profile_email_value": "Danialeyvaziiii@gamail.com",
  "profile_phone_label": "Telefonnummer :",
  "profile_phone_value": "+989363789203",
  "skills_heading": "FÄHIGKEITEN",
  "skills_description": "Innovativer und benutzerfreundlicher Webentwickler mit 1,5 Jahren Erfahrung in HTML, CSS und JavaScript. Schneller Lerner und kollaborativer Teamplayer. Leidenschaftlich daran interessiert, dynamische Websites zu erstellen. Bereit, zum Erfolg einer dynamischen Organisation beizutragen.",
  "skill_html5": "HTML 5",
  "skill_css3": "CSS 3",
  "skill_javascript": "Javascript",
  "skill_solidity": "SOLIDITY",
  "skill_tailwind_css": "Tailwind CSS",
  "skill_bootstrap": "Bootstrap",
  "skill_version_control_system": "Versionskontrollsystem",
  "skills_learning_intro": "Ich lerne auch :",
  "skill_react": "REACT",
  "skill_redux": "REDUX",
  "skill_nextjs": "NEXTJS",
  "skill_web3js": "WEB3 JS",
  "skill_mui": "MUI",
  "skill_pwa": "PWA",
  "button_hire_me": "MICH EINSTELLEN",
  "button_download_cv": "LEBENSLAUF HERUNTERLADEN",
  "resume_heading": "Lebenslauf",
  "resume_intro_title": "Weitere meiner Referenzen.",
  "resume_intro_text": "Mit einer Erfolgsbilanz und Expertise in der Webentwicklung bin ich zuversichtlich, dass meine Fähigkeiten und Erfolge Ihr Interesse wecken werden. Entdecken Sie in meinem umfassenden Lebenslauf, wie meine Erfahrung Ihren Bedürfnissen entspricht.",
  "education_heading": "Ausbildung",
  "edu_web_uni_title": "Bachelor der Informatik",
  "edu_web_uni_org": "Constructor Universität",
  "edu_web_uni_certificate": " Bremen, Gremany",
  "edu_web_dev_title": "Einführung in die Webentwicklung",
  "edu_web_dev_org": "META",
  "edu_web_dev_certificate": "Zertifikat ansehen",
  "edu_web_dev_description": "Der Meta-Kurs 'Einführung in die Webentwicklung' bietet den Vorteil eines umfassenden Lehrplans, fachkundiger Anleitung und praktischer Projekte, die es den Lernenden ermöglichen, praktische Fähigkeiten und Kenntnisse in der Webentwicklung (Webprotokolle, HTML, CSS, SEO, Server, ...) für die berufliche Weiterentwicklung zu erwerben.",
  "edu_html_css_title": "HTML und CSS im Detail",
  "edu_html_css_org": "META",
  "edu_html_css_certificate": "Zertifikat ansehen",
  "edu_html_css_description": "Der Meta-Kurs 'HTML und CSS im Detail' bietet den Vorteil einer detaillierten Anleitung, praktischer Übungen und realer Projekte, die es den Lernenden ermöglichen, die Feinheiten von HTML und CSS für die Erstellung visuell ansprechender und responsiver Webdesigns zu beherrschen.",
  "edu_javascript_title": "Programmieren mit JAVASCRIPT",
  "edu_javascript_org": "META",
  "edu_javascript_certificate": "Zertifikat ansehen",
  "edu_javascript_description": "Im Coursera-Kurs 'Meta Programming with JavaScript' habe ich eine Reihe wertvoller Fähigkeiten erworben, darunter fortgeschrittene JavaScript-Programmiertechniken, objektorientierte Programmierprinzipien, asynchrone Programmierung und die Fähigkeit, dynamische und interaktive Webanwendungen zu erstellen.",
  "edu_vcs_title": "Versionskontrollsysteme",
  "edu_vcs_org": "META",
  "edu_vcs_certificate": "Zertifikat ansehen",
  "edu_vcs_description": "Im Coursera-Kurs 'Meta Version Control System' habe ich wesentliche Fähigkeiten in Versionskontrollsystemen wie Git - Github - Git Bash erlernt. Ich weiß, wie man Code-Repositories effektiv verwaltet, mit anderen zusammenarbeitet, Änderungen verfolgt, Konflikte löst und die Integrität der Codebasis meines Projekts sicherstellt.",
  "edu_ui_ux_title": "UI/UX-Prinzipien",
  "edu_ui_ux_org": "META",
  "edu_ui_ux_certificate": "Zertifikat ansehen",
  "edu_ui_ux_description": "Fähigkeiten, die ich erworben habe: <br /> • Digitale Produkte entwerfen, die Wert schaffen und die Probleme eines Benutzers auf sinnvolle Weise lösen. <br /> • Erkennen, was erfolgreiche UX UI ausmacht, und bestehende Schnittstellen auf Designkonsistenz und -qualität bewerten. <br /> •  Ihre UX UI-Designs erstellen, teilen und testen.",
  "edu_blockchain_basics_title": "Blockchain-Grundlagen",
  "edu_blockchain_basics_org": "Universität in Buffalo",
  "edu_blockchain_basics_certificate": "Zertifikat ansehen",
  "edu_blockchain_basics_description": "Blockchain, Kryptographie, Protokolle, Arbeit mit virtuellen Maschinen in Ubuntu, Bitcoin.",
  "edu_smart_contract_dev_title": "Smart Contract Entwicklung",
  "edu_smart_contract_dev_org": "Universität in Buffalo",
  "edu_smart_contract_dev_certificate": "Zertifikat ansehen",
  "edu_smart_contract_dev_description": "Entwerfen, Entwickeln, Optimieren von Smart Contracts mit realen Anwendungsfällen (Auktionsprojekt) auf Remix IDE und vollständigen Solidity-, Openzipplin-, ... Grundlagen.",
  "edu_cs50_title": "CS50 (Einführung in die Informatik)",
  "edu_cs50_org": "Harvard Universität",
  "edu_cs50_certificate_note": "Ich habe kein Zertifikat für diesen Kurs, da ich die Kosten für das Zertifikat aufgrund meines Wohnsitzes im Iran nicht bezahlen kann 🙁",
  "edu_cs50_description": "Dies ist CS50x, die Einführung der Harvard University in die intellektuellen Unternehmungen der Informatik und die Kunst des Programmierens für Haupt- und Nebenfachstudenten gleichermaßen, mit oder ohne vorherige Programmiererfahrung. Ein Einführungskurs, der von David J. Malan unterrichtet wird, CS50x lehrt Studenten, algorithmisch zu denken und Probleme effizient zu lösen. Themen sind Abstraktion, Algorithmen, Datenstrukturen, Kapselung, Ressourcenmanagement, Sicherheit, Software-Engineering und Webentwicklung. Sprachen sind C, Python, SQL und JavaScript sowie CSS und HTML. Problemstellungen, inspiriert von realen Bereichen der Biologie, Kryptographie, Finanzen, Forensik und Spiele.",
  "edu_alidity_bootcamp_title": "Alidity Webentwicklung + Solidity-Programmierung",
  "edu_alidity_bootcamp_org": "@Alidity & @Bitbod (Instagram)",
  "edu_alidity_bootcamp_type": "Privates Bootcamp",
  "edu_alidity_bootcamp_description": "Es war ein einjähriges privates Bootcamp für Webentwicklung (HTML, CSS, Bootstrap, JS, GIT) + Smart Contract (Blockchain-Grundlagen, Smart Contract-Entwicklung (Solidity), Remix, Hardhat, Bereitstellung, ..), das von Bitbod (Instagram-Influencer und Unternehmer in der Blockchain-Branche) und Alidity (Instagram-Influencer und NFT-Experte) präsentiert wurde.",
  "edu_other_courses_title": "Viele andere Online-Kurse",
  "edu_other_courses_certificate_note": "Ohne Zertifikat",
  "edu_other_courses_description": "Ich habe auch viele Online-Bootcamps und Kurse besucht, die kein Zertifikat haben, aber ich habe viel von ihnen gelernt, wie z.B. React JS, Next JS, Tailwind CSS, Sass-Kurse und auch Dapp University-Kurse, Free Code Camp-Kurse und ...",
  "skills_section_heading": "FÄHIGKEITEN",
  "skill_ui_building_title": "Gut im UI-Bau",
  "skill_ui_building_tech": "Sass, CSS3, Bootstrap, Tailwind CSS",
  "skill_ui_building_description": "Hochqualifizierter UI-Entwickler mit Expertise im Aufbau von Benutzeroberflächen und Kenntnissen in verschiedenen UI-Building-Frameworks. Engagiert für die Bereitstellung visuell ansprechender und benutzerfreundlicher Designs, die das gesamte Benutzererlebnis verbessern, und ich bin in der Lage, fast jedes UI-Design zu erstellen.",
  "skill_javascript_knowledge_title": "Javascript-Kenntnisse",
  "skill_javascript_knowledge_tech": "ES6, Vanilla JS, OOP, ...",
  "skill_javascript_knowledge_description": "Fortgeschrittene Javascript-Kenntnisse (OOP, Test (JEST), DOM, AJAX, ES6, CRUD, SPA mit Vanilla JS, …). Ich kann fast jede Aufgabe im Zusammenhang mit dem Erstellen nützlicher Komponenten, interaktiver UI-Effekte und Animationen sowie der Arbeit mit APIs bewältigen, was ich bereits in meinen Projekten getan habe.",
  "skill_version_control_title": "Versionskontrolle",
  "skill_version_control_tech": "GIT, Github, Git Bash, Mac OS Terminal",
  "skill_version_control_description": "Verwendung des Git-Flow-Verfahrens, einschließlich (Branching, Pull, Push, Standard-Commit), um das Projekt und die Code-Überprüfung besser zu verwalten.",
  "skill_blockchain_ethereum_title": "Blockchain- und Ethereum-Grundlagen",
  "skill_blockchain_ethereum_tech": "Blockchain, Mining, Minting, Ethereum-Ökosystem, Defi, Protokolle, ...",
  "skill_blockchain_ethereum_description": "Alles über Blockchain (insbesondere Ethereum), Protokolle, Ökosysteme, Transaktionen, Mining-System, Datenspeichersystem, ..... .",
  "skill_smart_contract_dev_title": "Smart Contract Entwicklung",
  "skill_smart_contract_dev_tech": "Solidity, Hardhat, EthersJS",
  "skill_smart_contract_dev_description": "Entwicklung, Bereitstellung, Ausführung und Sicherung optimierter Smart Contracts mit den modernsten und aktualisierbarsten Frameworks der Solidity-Sprache.",
  "skill_packages_libraries_title": "Arbeiten mit Paketen und Bibliotheken",
  "skill_packages_libraries_tech": "NPM, Node, Paketmanager, Skripte, ...",
  "skill_packages_libraries_description": "Nutzung des Node Package Managers in Projekten zur Implementierung bekannter Bibliotheken. Ich weiß, wie man verschiedene Pakete installiert, initialisiert und verwaltet.",
  "skill_languages_title": "Mehrere Sprachen sprechen",
  "skill_languages_tech": "Deutsch, Englisch, Persisch",
  "skill_languages_description": "Ich spreche gut Englisch (auf dem Niveau von etwa IELTS 6 - 6,5) und bin sehr zufrieden damit, in englischsprachigen Unternehmen und Teams zu arbeiten. Außerdem habe ich Deutsch am Goethe-Institut bis zum B1-Niveau gelernt und Persisch ist meine Muttersprache.",
  "projects_heading": "PROJEKTE",
  "projects_intro_title": "Hier sind meine Top-Projekte.",
  "projects_intro_text": "Hier sind einige meiner anspruchsvollsten Projekte, bei denen ich mein Bestes gegeben habe, um meine Fähigkeiten zu zeigen, und ich habe auch versucht, sie detailliert zu erstellen.",
  "project_personal_portfolio_title": "Persönliches Portfolio",
  "project_personal_portfolio_tech": "HTML5, SASS (scss), Vanilla JS, Swiper JS",
  "project_personal_portfolio_description": "Meine persönliche Portfolio-App mit ausgefallenen Effekten und einem möglichst minimalistischen UI-Design, erstellt mit HTML5, SASS (scss), Vanilla JS, Swiper JS, in der Sie sich gerade befinden 😃.",
  "project_links_heading": "Projekt-Links",
  "project_view_on_github": "Projekt auf Github ansehen",
  "project_view_on_vercel": "Projekt auf VERCEL ansehen",
  "project_todo_list_title": "To-Do-Listen-App",
  "project_todo_list_tech": "HTML5, Tailwind CSS, lokaler Speicher, JS",
  "project_todo_list_description": "Eine To-Do-Listen-App mit: Hinzufügen von To-Do-Elementen, Entfernen von To-Do-Elementen, Bearbeiten von To-Do-Elementen und Speichern, Entfernen, Bearbeiten von Elementen im lokalen Speicher. Erstellt mit (HTML 5 - CSS 3 - JS)",
  "project_weather_app_title": "Wetter-App",
  "project_weather_app_tech": "HTML5, CSS3, Fetch API, JS",
  "project_weather_app_description": "Eine Wetter-App mit responsivem und minimalistischem UI-Design, die die reale Online-Wetter-API namens \"Open Weather Map API\" mit der Fetch API-Methode verwendet, erstellt mit HTML, CSS, Javascript und auf jedem Gerät nutzbar.",
  "project_spa_app_title": "SPA-App (Single Page Application)",
  "project_spa_app_tech": "HTML5, Tailwind CSS, DaisyUI, JS (modular)",
  "project_spa_app_description": "Eine Single Page Application mit Landingpage - Navigationsmenü, +5 Themes und vielen interaktiven Seiten und Komponenten, ... . Erstellt mit (HTML 5 - Tailwind CSS - JS)",
  "project_note_app_title": "Notiz-App (OOP)",
  "project_note_app_tech": "OOP, Tailwind CSS",
  "project_note_app_description": "Eine NOTIZ-App mit: OOP (Objektorientierte Programmierung), Hinzufügen von Notizen, Bearbeiten von Notizen und minimalistischem und interaktivem Design.",
  "project_tic_tac_toe_title": "TIC TAC TOE Spiel",
  "project_tic_tac_toe_tech": "Javascript",
  "project_tic_tac_toe_description": "Dieses Projekt ist ein Tic Tac Toe-Spiel, das in Javascript implementiert wurde.",
  "project_school_management_contract_title": "Schulverwaltungs-Smart Contract",
  "project_school_management_contract_tech": "Solidity-Sprache, Blockchain",
  "project_school_management_contract_description": "Mein allererstes Projekt mit der Solidity-Sprache auf Remix IDE. Es dient als mein praktisches Projekt für das Solidity-Bootcamp und zeigt meine Fähigkeiten und mein Verständnis der Smart Contract-Entwicklung.",
  "project_inventory_app_title": "INVENTAR-APP (OOP)",
  "project_inventory_app_tech": "HTML5, Tailwind CSS, OOP",
  "project_inventory_app_description": "An INVENTORY app with : OOP (Object Oriented programming) , Adding Inventory items , editing, Sorting items by adding date , listing all available items and ... .",
  "project_inventory_app_status": "In Bearbeitung ...",
  "project_more_components_title": "Mehr als 10 nützliche Komponenten und Mini-Projekte und Mini-Projekte",
  "project_more_components_tech": "Html, CSS, JS, Alpine JS, Swiper JS, Animista, ...",
  "project_more_components_description": "Sie können mehr als 10 nützliche Komponenten mit verschiedenen Frameworks und Bibliotheken auf meinem GITHUB-Konto sehen, wie z.B. Login-/Registrierungsformulare, Landingpages, Karten, Dark-Mode-Umschalter, Akkordeon-Menü, Radio-Gruppen-Button, ... .",
  "service_heading": "DIENSTLEISTUNG",
  "service_intro_title": "Was kann ich für Sie tun?",
  "service_intro_text": "Hier sehen Sie, was ich für Sie und Ihr Unternehmen tun kann.",
  "service_web_app_dev_title": "Webanwendungsentwicklung",
  "service_web_app_dev_description": "Mein Service für den Frontend-Bau von Webanwendungen nutzt HTML, CSS und JavaScript sowie gängige Frameworks. Wir erstellen visuell ansprechende und interaktive Benutzeroberflächen, die das Benutzererlebnis verbessern und nahtlose Funktionalität bieten.",
  "service_smart_contract_dev_title": "Smart Contract Entwicklung",
  "service_smart_contract_dev_description": "Unser Smart Contract Entwicklungsdienst auf der Ethereum-Blockchain nutzt die Solidity-Sprache und das Hardhat-Framework. Wir erstellen sichere und effiziente Smart Contracts, die Transaktionen automatisieren, Vereinbarungen durchsetzen und dezentrale Anwendungen mit Transparenz und Vertrauen ermöglichen.",
  "service_nft_projects_title": "NFT-Projekte",
  "service_nft_projects_description": "Unser NFT-Projektentwicklungsdienst nutzt die Solidity-Sprache und das Hardhat-Framework. Wir erstellen einzigartige und sichere Non-Fungible Tokens (NFTs), die digitale Eigentumsrechte, Herkunft und Authentizität für verschiedene Branchen, einschließlich Kunst, Gaming, Sammlerstücke und mehr, ermöglichen.",
  "service_portfolio_commercial_websites_title": "Portfolio- oder kommerzielle Websites",
  "service_portfolio_commercial_websites_description": "Sie können die besten Portfolio- oder kommerziellen Websites (wie diese hier!) mit jedem gewünschten interaktiven Design haben, und ich würde dies von A bis Z selbst erledigen!",
  "footer_contact_heading": "KONTAKT",
  "footer_contact_intro_title": "Ich würde mich freuen, von Ihnen zu hören.",
  "footer_contact_intro_text": "Vielen Dank für Ihren Besuch auf meiner Portfolio-Website. Ich würde mich freuen, mit Ihnen in Kontakt zu treten und alle Möglichkeiten, Kooperationen oder Anfragen zu besprechen, die Sie haben könnten. Egal, ob Sie ein Projekt im Sinn haben oder einfach nur Hallo sagen möchten, zögern Sie nicht, mich über das untenstehende Kontaktformular zu kontaktieren. Ich freue mich darauf, von Ihnen zu hören und zu erkunden, wie wir zusammenarbeiten können, um Ihre Ideen zum Leben zu erwecken. <br />Ich freue mich darauf, bald mit Ihnen in Kontakt zu treten!",
  "footer_location_heading": "WO SIE MICH FINDEN",
  "footer_location_value": "Teheran, Teheran, Iran",
  "footer_email_heading": "E-MAIL AN MICH",
  "footer_email_value": "Danialeyvaziiii@gamail.com",
  "footer_whatsapp_heading": "WHATSAPP",
  "footer_whatsapp_value": "+989363789203",
  "footer_linkedin_heading": "LINKEDIN",
  "footer_linkedin_value": "Zum Anzeigen auf Symbol klicken",
  "footer_github_heading": "GITHUB",
  "footer_github_value": "Zum Anzeigen auf Symbol klicken",
  "footer_copyright": "| Vollständig von Danial Eyvazi im Jahr 2023 kodiert |",
  "footer_design_credit": "Entworfen von Sltyleshout und vertrieben von Danial Eyvazi"
}
